clochetteRails/app/controllers/facturations_controller.rb

SELECT * FROM "facturations"
---
  def index
    @facturations = Facturation.all

SELECT * FROM "facturations" WHERE ("facturations"."id" = 980190962)
---
  def show
    @facturation = Facturation.find(params[:id])

SELECT * FROM "facturations" WHERE ("facturations"."id" = 980190962)
---
  def edit
    @facturation = Facturation.find(params[:id])

INSERT INTO "facturations" ("date_archivage", "updated_at", "etat_valide?", "nb_heures_a_facturer", "facturation_envoyee?", "liste_dev_attente_validation", "created_at") VALUES(NULL, '2010-07-18 09:42:37', NULL, NULL, NULL, NULL, '2010-07-18 09:42:37')
---
  def create
    @facturation = Facturation.new(params[:facturation])

    respond_to do |format|
      if @facturation.save

SELECT * FROM "facturations" WHERE ("facturations"."id" = 980190962)
---
  def update
    @facturation = Facturation.find(params[:id])

SELECT * FROM "facturations" WHERE ("facturations"."id" = 980190962)
DELETE FROM "facturations" WHERE "id" = 980190962
---
  def destroy
    @facturation = Facturation.find(params[:id])
    @facturation.destroy