clochetteRails/app/controllers/pages_controller.rb

SELECT * FROM "clients" LIMIT 1
---
  def infos_facturation
     @infos_clients = {}
     Client.all.each do |client|

SELECT * FROM "clients"
---
  def infos_facturation_mois_dernier
    @infos_clients = {}
     Client.all.each do |client|