clochetteRails/app/controllers/pages_controller.rb

SELECT * FROM "clients" ORDER BY nom
---
  def main_angelique
    @page_title="Page principale d'angelique"
    @infos_client_mois_courant = {}
    Client.all.each do | client |

SELECT * FROM "clients" ORDER BY nom
---
  def ang_gestion_facturations
    #TODO: refactoring
    @page_title='Gestion des facturations'
    @infos_client_mois_courant = {}
    Client.all.each do | client |