clochetteRails/app/controllers/travail_developpeurs_controller.rb

  def index
    @travail_developpeurs = TravailDeveloppeur.all
---
SELECT * FROM "travail_developpeurs"

  def show
    @travail_developpeur = TravailDeveloppeur.find(params[:id])
---
SELECT * FROM "travail_developpeurs" WHERE ("travail_developpeurs"."id" = 980190962)

  def edit
    @travail_developpeur = TravailDeveloppeur.find(params[:id])
---
SELECT * FROM "travail_developpeurs" WHERE ("travail_developpeurs"."id" = 980190962)

  def create
    @travail_developpeur = TravailDeveloppeur.new(params[:travail_developpeur])

    respond_to do |format|
      if @travail_developpeur.save
---
INSERT INTO "travail_developpeurs" ("updated_at", "nb_jours_travail", "client", "validation_nb_jours_travail?", "nom_developpeur", "created_at") VALUES('2010-07-18 10:16:33', NULL, NULL, NULL, NULL, '2010-07-18 10:16:33')

  def update
    @travail_developpeur = TravailDeveloppeur.find(params[:id])
---
SELECT * FROM "travail_developpeurs" WHERE ("travail_developpeurs"."id" = 980190962)

  def destroy
    @travail_developpeur = TravailDeveloppeur.find(params[:id])
    @travail_developpeur.destroy
---
SELECT * FROM "travail_developpeurs" WHERE ("travail_developpeurs"."id" = 980190962)
DELETE FROM "travail_developpeurs" WHERE "id" = 980190962