app/controllers/clients_controller.rb

SELECT * FROM "clients" ORDER BY nom
---
  def index
    @clients = Client.all

SELECT * FROM "clients" WHERE ("clients"."id" = 2) ORDER BY nom
---
  def show
    @client = Client.find(params[:id])

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO "clients" ("nom", "updated_at", "infos_projets", "client_ce_mois", "description", "created_at") VALUES('Vinci', '2010-07-18 11:56:06', 'VCSI', 'f', '', '2010-07-18 11:56:06')
---
  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
UPDATE "clients" SET "jours_a_facturer" = 10, "updated_at" = '2010-07-15 12:02:10' WHERE "id" = 1
---
  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])

SELECT * FROM "clients" WHERE ("clients"."id" = 3)
DELETE FROM "clients" WHERE "id" = 3
---
  def destroy
    @client = Client.find(params[:id])
    @client.destroy