app/controllers/utilisateurs_controller.rb

SELECT * FROM "utilisateurs"
---
  def index
    @utilisateurs = Utilisateur.all

SELECT * FROM "utilisateurs" WHERE ("utilisateurs"."id" = 1)
---
  def show
    @utilisateur = Utilisateur.find(params[:id])

INSERT INTO "utilisateurs" ("updated_at", "login", "password", "created_at") VALUES('2010-07-18 20:28:01', 'angelique', '', '2010-07-18 20:28:01')
---
  def create
    @utilisateur = Utilisateur.new(params[:utilisateur])

    respond_to do |format|
      if @utilisateur.save

SELECT * FROM "utilisateurs" WHERE ("utilisateurs"."id" = 1)
DELETE FROM "utilisateurs" WHERE "id" = 1
---
  def destroy
    @utilisateur = Utilisateur.find(params[:id])
    @utilisateur.destroy